//===========================================================================
//! @file SceneRetry.h
//! @brief リザルトシーン
//===========================================================================
#pragma once

//---------------------------------------------------------------------------
//! @class SceneRetry
//! @brief リザルトシーン
//---------------------------------------------------------------------------
class SceneRetry : public Scene::Base
{
public:
    BP_CLASS_DECL(SceneRetry, u8"SceneRetry");

    //! @brief 初期化
    //! @return 初期化済み
    bool Init() override;

private:
};
