#pragma once
//===========================================================================
//! @file ActionAttackBase.h
//! @brief 敵の攻撃アクション基底クラス
//===========================================================================
#include <Game/Component/Enemy/EnemyActionBase.h>

//---------------------------------------------------------------------------
//! @class ActionAttackBase
//! @brief 敵の攻撃アクション基底クラス
//---------------------------------------------------------------------------
class ActionAttackBase : public EnemyActionBase
{
};
