#pragma once
//===========================================================================
//! @file Bottle.h
//! @brief 回復アイテム
//===========================================================================

USING_PTR(Bottle);
//---------------------------------------------------------------------------
//! @class Bottle
//! @brief 回復アイテム
//---------------------------------------------------------------------------
class Bottle : public Object
{
public:
    BP_OBJECT_DECL(Bottle, "Bottle");

    //! @brief 初期化
    //! @return 初期化済み
    bool Init() override;

private:
};
