//===========================================================================
//! @file Truck.h
//! @brief トラック
//===========================================================================
#pragma once

USING_PTR(Truck);

//---------------------------------------------------------------------------
//! @class Truck
//! @brief トラック
//---------------------------------------------------------------------------
class Truck : public Object
{
public:
    BP_OBJECT_DECL(Truck, "Track");

    //! @brief 初期化
    //! @return 初期化済み
    bool Init() override;

private:
};
